{
  "data": [
    {
      "company": "Vmware",
      "title": "Senior Frontend Engineer",
      "start": 2021,
      "end": null,
      "experiences": [
        "Contributed to migration effort from class based React and Alt.js to functional components and Redux",
      "Created preference feature to allow fine tuning of observability intake and output.",
      "Reduced redundancies within component library and replaced with more reusable components."
      ]
    },
    {
      "company": "Walmart",
      "title": "Frontend Tech Lead",
      "start": 2019,
      "end": 2021,
      "experiences": [
        "Led team of 3 developers transitioning projects from redux and JS to MOBX and typescript",
      "Researched and developed an inhouse observability tool for error tracing",
      "Remodeled multiple excel reports into fully interactive dashboards with drilldown support, and vastly improved speed"
      ]
    },
    {
      "company": "J.B. Hunt",
      "title": "Software Developer",
      "start": 2017,
      "end": 2018,
      "experiences": [
        "Designed automated regression strategy that reduced testing from 2 weeks to 1 hour",
        "Established testing standards for team with guided demo sessions and trainings.",
        "Worked on migration from ext.js to Angular 4.0"
      ]
    },
    {
      "company": "Pam Transport",
      "title": "Software Developer",
      "start": 2016,
      "end": 2017,
      "experiences": [
        "Streamlined existing api batch job from taking 2+ hours to 20 minutes for daily job.",
        "Led website remodel into current technologies and mobile friendly User Interface",
        "Oversaw benefits program audit and provided improved data visualization for HR and Accounting departments"
      ]
    },
    {
      "company": "Walmart",
      "title": "Associate Software Developer",
      "start": 2015,
      "end": 2016,
      "experiences": [
        "Updated all existing applications to support iPad format and sizing",
        "Improved SQL queries by removing redundant and applied new logic for rigidity",
        "Prepared foundations for transitioning to React.js from Vanilla JS"
      ]
    }
  ]
}